src/agenda/typescript.tex
% Created 2017-04-23 Sun 23:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{geometry}
\hypersetup{colorlinks, citecolor=black, filecolor=black, linkcolor=black, urlcolor=grey}
\author{Francesco Antonello Ferraro}
\date{\today}
\title{Typescript}
\hypersetup{
 pdfauthor={Francesco Antonello Ferraro},
 pdftitle={Typescript},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.2 (Org mode 9.0.5)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Descrição}
\label{sec:org37e1ee7}

Como o próprio website diz, Typescript é um \textbf{superset} da linguagem Javascript. E por \textbf{superset} ele querem dizer, que a liguagem criada adiciona uma poderosa ferramentas que não está inclusas na liguagem de origem. Javascript é uma liguagem fracamente tipa, ou seja, os dados incluidos em suas variaveis não são impostos. E é exatamente isso que a Typescript vem tentar implementar.
Pode parecer uma pequena mudança, mas considerando o alcance mundial do Javascript. Esse pode ser o maior avanço da linguagem em décadas. Segundo o site \url{https://stackoverflow.com} em \href{http://stackoverflow.com/insights/survey/2016}{análise anual dos dados de tráfego do ano de 2016} \footnote{\url{http://stackoverflow.com/insights/survey/2016}} .
\begin{quote}
Javascript é a linguagem de programação mais comunmente usada no planeta terra. Até desenvolvedores Back-End estão mais predispostos a usá-la do que qualquer outra linguagem.
\end{quote}

\section{Author}
\label{sec:org5584de7}
É um projeto oficialmente criado pela Microsoft. Está é a \href{https://github.com/Microsoft/TypeScript/blob/master/AUTHORS.md}{lista do principais desenvolvedores}  \footnote{\url{https://github.com/Microsoft/TypeScript/blob/master/AUTHORS.md}} do projeto disponibilzada pela empresa no seu repositória em github.com.
O nome mais proeminente é o do Dinamarquês Anders Hejlsberg, mundialmente conhecido com principal arquiteto da linguagem de programaćão Delphi e do ambiente de desenvolvimento de software Turbo Pascal.

\section{Ano}
\label{sec:org77f5f92}
2012

\section{Examplos}
\label{sec:org6e20e1a}
\begin{verbatim}
const cesco = Math.random();
\end{verbatim}

\section{Bibliografia}
\label{sec:org9d4b383}
\subsection{Impressa}
\label{sec:org9b56c01}

\begin{itemize}
\item Nome: Essential TypeScript | It’s JavaScript\ldots{} only better.
\item Author: Jess Chadwick
\end{itemize}

\subsection{Links}
\label{sec:org1a2b864}
\begin{itemize}
\item Typescript Deep Dive
\item \url{https://basarat.gitbooks.io/typescript/}
\end{itemize}
\end{document}
